In [2]:
import pandas as pd

# Series
fruits = {'orange': 2, 'banana': 3}
print(pd.Series(fruits))

# DataFrame
data = {'fruits': ['apple', 'orange', 'banana', 'strawberry', 'kiwifruit'],
         'year': [2001, 2002, 2001, 2008, 2006],
         'time': [1, 4, 5, 6, 3]}

df = pd.DataFrame(data)
print(df)

orange    2
banana    3
dtype: int64
       fruits  year  time
0       apple  2001     1
1      orange  2002     4
2      banana  2001     5
3  strawberry  2008     6
4   kiwifruit  2006     3

In [25]:
## Series

index = ['apple', 'orange', 'banana', 'strawberry', 'kiwifruit']
data = [10, 5, 8, 12, 3]

series = pd.Series(data, index=index)

series

apple         10
orange         5
banana         8
strawberry    12
kiwifruit      3
dtype: int64

In [4]:
series[0:2]

apple     10
orange     5
dtype: int64

In [5]:
series['orange']

5

In [6]:
series.values

array([10,  5,  8, 12,  3], dtype=int64)

In [7]:
series.index

Index(['apple', 'orange', 'banana', 'strawberry', 'kiwifruit'], dtype='object')

In [14]:
series.append(pd.Series([3], index=['grape']))

# series = ~ 에 저장해야지 실제로 반영됨

C:\Users\Kang MinJae\AppData\Local\Temp\ipykernel_24120\217487370.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  series.append(pd.Series([3], index=['grape']))

apple         10
orange         5
banana         8
strawberry    12
kiwifruit      3
grape          3
grape          3
dtype: int64

In [15]:
series.drop('strawberry')

# series = ~ 에 저장해야 실제로 반영됨

apple        10
orange        5
banana        8
kiwifruit     3
grape         3
dtype: int64

In [19]:
conditions = [True, True, False, False, False]
series[conditions]

apple     10
orange     5
dtype: int64

In [20]:
series[series >= 5]

apple         10
orange         5
banana         8
strawberry    12
dtype: int64

In [22]:
series.sort_index()  # 따로 저장해야함

apple         10
banana         8
kiwifruit      3
orange         5
strawberry    12
dtype: int64

In [23]:
series.sort_values()  # 따로 저장해야함

kiwifruit      3
orange         5
banana         8
apple         10
strawberry    12
dtype: int64

In [24]:
series

apple         10
orange         5
banana         8
strawberry    12
kiwifruit      3
dtype: int64

In [27]:
## DataFrame - Series를 여러개 묶은 것 같은 2차원 데이터 구조

data = {'fruits': ['apple', 'orange', 'banana', 'strawberry', 'kiwifruit'],
        'year': [2001, 2002, 2001, 2008, 2006],
        'time': [1, 4, 5, 6, 3]}

df = pd.DataFrame(data)
df

       fruits  year  time
0       apple  2001     1
1      orange  2002     4
2      banana  2001     5
3  strawberry  2008     6
4   kiwifruit  2006     3

In [28]:
index = ['apple', 'orange', 'banana', 'strawberry', 'kiwifruit']
data1 = [10, 5, 8, 12, 3]
data2 = [30, 25, 12, 10, 8]
series1 = pd.Series(data1, index=index)
series2 = pd.Series(data2, index=index)

df = pd.DataFrame([series1, series2])

df

   apple  orange  banana  strawberry  kiwifruit
0     10       5       8          12          3
1     30      25      12          10          8

In [31]:
df.index = [1, 2]
df

   apple  orange  banana  strawberry  kiwifruit
1     10       5       8          12          3
2     30      25      12          10          8

In [38]:
data = {'fruits': ['apple', 'orange', 'banana', 'strawberry', 'kiwifruit'],
        'time': [1, 4, 5, 6, 3]}

df = pd.DataFrame(data)
series = pd.Series(['mango', 2008, 7], index=['fruits', 'year', 'time'])

df = df.append(series, ignore_index=True)
df

C:\Users\Kang MinJae\AppData\Local\Temp\ipykernel_24120\2060485050.py:7: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(series, ignore_index=True)

       fruits  time    year
0       apple     1     NaN
1      orange     4     NaN
2      banana     5     NaN
3  strawberry     6     NaN
4   kiwifruit     3     NaN
5       mango     7  2008.0

In [41]:
data = {'fruits': ['apple', 'orange', 'banana', 'strawberry', 'kiwifruit'],
        'year': [2001, 2002, 2001, 2008, 2006],
        'time': [1, 4, 5, 6, 3]}

df = pd.DataFrame(data)

df = df.loc[[1, 2], ['fruits', 'year']]
df

   fruits  year
1  orange  2002
2  banana  2001

In [46]:
data = {'fruits': ['apple', 'orange', 'banana', 'strawberry', 'kiwifruit'],
        'year': [2001, 2002, 2001, 2008, 2006],
        'time': [1, 4, 5, 6, 3]}

df = pd.DataFrame(data)
df.drop(range(0, 2))

       fruits  year  time
2      banana  2001     5
3  strawberry  2008     6
4   kiwifruit  2006     3

In [51]:
df.drop('year', axis=1)

       fruits  time
0       apple     1
1      orange     4
2      banana     5
3  strawberry     6
4   kiwifruit     3

In [52]:
df.sort_values(by='year', ascending=True)

       fruits  year  time
0       apple  2001     1
2      banana  2001     5
1      orange  2002     4
4   kiwifruit  2006     3
3  strawberry  2008     6

In [54]:
df.sort_values(by=['year', 'time'], ascending=True)

       fruits  year  time
0       apple  2001     1
2      banana  2001     5
1      orange  2002     4
4   kiwifruit  2006     3
3  strawberry  2008     6

In [55]:
df.index % 2 == 0

array([ True, False,  True, False,  True])

In [56]:
df[df.index % 2 == 0]

      fruits  year  time
0      apple  2001     1
2     banana  2001     5
4  kiwifruit  2006     3

In [59]:
df.loc[df['year'] >= 2002]

       fruits  year  time
1      orange  2002     4
3  strawberry  2008     6
4   kiwifruit  2006     3